Словарь/src/Catalogs/Словарь/Словарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Словарь</name>
  <attributes>
    <name>ЗаписьНаЯпонском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСлова</name>
    <type>
      <types>EnumRef.ВидыСлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйСлог</name>
    <type>
      <types>CatalogRef.Слоги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Слог</name>
      <type>
        <types>CatalogRef.Слоги</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставНовый</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Enums/ВидыКаны/ВидыКаны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКаны</name>
  <enumValues>
    <name>Хирагана</name>
  </enumValues>
  <enumValues>
    <name>Катакана</name>
  </enumValues>
</mdclass:Enum>

Словарь/src/Catalogs/Словарь/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Состав.Количество() > 0 Тогда
		ПервыйСлог = Состав[0].Слог;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Канджи") Тогда
		СтандартнаяОбработка = Ложь;
		КанджиОбъект = ДанныеЗаполнения.ПолучитьОбъект();
		Наименование = КанджиОбъект.Наименование;
		ЗаписьНаЯпонском = КанджиОбъект.ЮникодПредставление;
		
		Комментарий = КанджиОбъект.ОсновноеЗначение;
		
		Чтение = КанджиОбъект.Чтения[0].Чтение;
		Для Каждого СтрокаСлог Из Чтение.Состав Цикл
			НоваяСтрока = Состав.Добавить();
			НоваяСтрока.Слог = СтрокаСлог.Слог;
			НоваяСтрока.Запись = Перечисления.ВидыКаны.Хирагана;
			НоваяСтрока.Канджи = ДанныеЗаполнения;
			Расшифровка = Расшифровка + СтрокаСлог.Слог.ЗаписьХираганой;
		КонецЦикла;
		ПервыйСлог = Состав[0].Слог;
		
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДополнительныеСвойства.Вставить("ИсточникКопирования", ОбъектКопирования.Ссылка);
	
КонецПроцедуры
